app/views/homes/_recommendation_modals.html.erb

SELECT "recommendations".* FROM "recommendations"
---
    <!-- Review Modals-->
		<% Recommendation.all.each_with_index do |recommendation, index|%>