app/views/homes/_recommendations.html.erb

SELECT "recommendations".* FROM "recommendations"
---
            <div class="row">
                <% Recommendation.all.each_with_index do |recommendation, index|%>